#Регистрация
.//p[text()='Личный Кабинет'] # Кнопка "Личный кабинет" на главной странице
.//a[text()='Зарегистрироваться'] # Надпись "Зарегистрироваться"
.//fieldset[1]//input # Поле имя в окне регистрации
.//fieldset[2]//input # Поле емейл в окне регистрации
.//fieldset[3]//input # Поле пароль в окне регистрации
.//button[text()='Зарегистрироваться'] # Кнопка Зарегистрироваться
.//p[text()='Некорректный пароль'] #Ошибка при некорректном пароле при регистрации

#Вход
.//button[text()='Войти в аккаунт'] #Кнопка "Войти в аккаунт"
.//a[text()='Войти'] #Кнопка входа в окне регистрации
.//a[text()='Восстановить пароль'] #Кнопка восстановления пароля
.//a[text()='Войти'] #Кнопка входа в окне восстановления пароля
.//button[text()='Войти'] #Кнопка "Войти" в форме входа
.//fieldset[1]//input #Поле емейл в окне входа
.//fieldset[2]//input #Поле пароль в окне входа
.//button[text()='Оформить заказ'] #Кнопка "Оформить заказ"

.//a[text()='Профиль'] #Элемент "Профиль" в личном кабинете
.//a[text()='Выход'] #Элемент "Выход" в личном кабинете
.//p[text()='Конструктор'] #Конструктор
.//div/header/nav/div/a/* #Логотип Stellar Burgers
.//span[text()='Булки'] #раздел «Булки»
.//span[text()='Соусы']#раздел "Соусы"
.//span[text()='Начинки']#раздел "Начинки"